In [2]:
import pandas as pd

In [5]:
df = pd.DataFrame( [['Anna', 23,3],
               ["Sam", 36,12],
               ["Bill", 33,10],
               ["Moica", 25,7],
               ["Lisa", 27,7],
               ["Peter",32, None]] )
df

       0   1     2
0   Anna  23   3.0
1    Sam  36  12.0
2   Bill  33  10.0
3  Moica  25   7.0
4   Lisa  27   7.0
5  Peter  32   NaN

In [6]:
df[0] # Series

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: 0, dtype: object

In [10]:
df.columns = ["Name", "age", 'expr']
df

    Name  age  expr
0   Anna   23   3.0
1    Sam   36  12.0
2   Bill   33  10.0
3  Moica   25   7.0
4   Lisa   27   7.0
5  Peter   32   NaN

In [11]:
df.iloc[1,2]

12.0

In [14]:
df.iloc[1:3,1]

1    36
2    33
Name: age, dtype: int64

In [16]:
df['Name']

0     Anna
1      Sam
2     Bill
3    Moica
4     Lisa
5    Peter
Name: Name, dtype: object

In [18]:
df[["Name","expr"]]

    Name  expr
0   Anna   3.0
1    Sam  12.0
2   Bill  10.0
3  Moica   7.0
4   Lisa   7.0
5  Peter   NaN

In [19]:
df.index = df['Name']
df

        Name  age  expr
Name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [22]:
df.loc["Bill", "age"]

33

In [23]:
df.loc["Sam":"Lisa", "expr"]

Name
Sam      12.0
Bill     10.0
Moica     7.0
Lisa      7.0
Name: expr, dtype: float64

In [24]:
df.loc["Sam":"Lisa", ["age", "expr"]]

       age  expr
Name
Sam     36  12.0
Bill    33  10.0
Moica   25   7.0
Lisa    27   7.0

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Anna to Peter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   age     6 non-null      int64
 2   expr    5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 364.0+ bytes

In [26]:
df.shape[0]

6

In [27]:
df.shape[1]

3

In [28]:
df.describe()

             age       expr
count   6.000000   5.000000
mean   29.333333   7.800000
std     5.085928   3.420526
min    23.000000   3.000000
25%    25.500000   7.000000
50%    29.500000   7.000000
75%    32.750000  10.000000
max    36.000000  12.000000

In [29]:
df.columns

Index(['Name', 'age', 'expr'], dtype='object')

In [30]:
list(df.columns)

['Name', 'age', 'expr']

In [31]:
df.index

Index(['Anna', 'Sam', 'Bill', 'Moica', 'Lisa', 'Peter'], dtype='object', name='Name')

In [32]:
df.head()

        Name  age  expr
Name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0

In [33]:
df.tail()

        Name  age  expr
Name
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0
Peter  Peter   32   NaN

In [34]:
df.head(2)

      Name  age  expr
Name
Anna  Anna   23   3.0
Sam    Sam   36  12.0

In [37]:
df = df.dropna() # --Peter т.к. есть поле None
df

        Name  age  expr
Name
Anna    Anna   23   3.0
Sam      Sam   36  12.0
Bill    Bill   33  10.0
Moica  Moica   25   7.0
Lisa    Lisa   27   7.0

In [41]:
df[df['age'] > 30]

      Name  age  expr
Name
Sam    Sam   36  12.0
Bill  Bill   33  10.0

In [42]:
df[(df['age']> 30)&(df['expr'] > 7)]

      Name  age  expr
Name
Sam    Sam   36  12.0
Bill  Bill   33  10.0

In [45]:
df[(df['age'] > 35) | (df['age'] < 25)]

      Name  age  expr
Name
Anna  Anna   23   3.0
Sam    Sam   36  12.0

In [46]:
df['age_sq'] = df['age']**2

In [47]:
df

        Name  age  expr  age_sq
Name
Anna    Anna   23   3.0     529
Sam      Sam   36  12.0    1296
Bill    Bill   33  10.0    1089
Moica  Moica   25   7.0     625
Lisa    Lisa   27   7.0     729

In [48]:
df['status'] = "w"

In [49]:
df

        Name  age  expr  age_sq status
Name
Anna    Anna   23   3.0     529      w
Sam      Sam   36  12.0    1296      w
Bill    Bill   33  10.0    1089      w
Moica  Moica   25   7.0     625      w
Lisa    Lisa   27   7.0     729      w

In [50]:
df["gender"] = [0,1,1,0,0]

In [51]:
df

        Name  age  expr  age_sq status  gender
Name
Anna    Anna   23   3.0     529      w       0
Sam      Sam   36  12.0    1296      w       1
Bill    Bill   33  10.0    1089      w       1
Moica  Moica   25   7.0     625      w       0
Lisa    Lisa   27   7.0     729      w       0

In [53]:
df['no_work'] = df["age"] - df["expr"] - 18
df

        Name  age  expr  age_sq status  gender  no_work
Name
Anna    Anna   23   3.0     529      w       0      2.0
Sam      Sam   36  12.0    1296      w       1      6.0
Bill    Bill   33  10.0    1089      w       1      5.0
Moica  Moica   25   7.0     625      w       0      0.0
Lisa    Lisa   27   7.0     729      w       0      2.0

In [54]:
class Person:
    def __init__(self, name, age):
        self.name = name
        self.age = age

people = [Person('Alice', 25), Person('Bob', 30), Person('Charlie', 22)]
people.sort(key=lambda person: person.age)
for person in people:
    print(person.name, person.age)

Charlie 22
Alice 25
Bob 30